PH_data/alpha_1.5/0/UDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
25404
(
( 0.0007801688043 0.0003806890454 -3.023947556e-06 )
( 0.0007682043361 0.0003744136193 -2.981530088e-06 )
( 0.001644535572 0.0008005800773 -6.533405667e-06 )
( 0.001621952048 0.0007887545507 -6.50504262e-06 )
( 0.0007602544501 0.0003714856866 -2.951223451e-06 )
( 0.002864849987 0.001390166231 -1.170117775e-05 )
( 0.002826524433 0.001370010315 -1.166008133e-05 )
( 0.001604524092 0.0007819822058 -6.437166121e-06 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
